; ModuleID = '/home/vagrant/selinux_policy_checker/SVF/examples/coreutils/src/cat.c'
source_filename = "/home/vagrant/selinux_policy_checker/SVF/examples/coreutils/src/cat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@stdout = external global ptr, align 8
@.str.3 = private unnamed_addr constant [335 x i8] c"\0A  -A, --show-all           equivalent to -vET\0A  -b, --number-nonblank    number nonempty output lines, overrides -n\0A  -e                       equivalent to -vE\0A  -E, --show-ends          display $ at end of each line\0A  -n, --number             number all output lines\0A  -s, --squeeze-blank      suppress repeated empty output lines\0A\00", align 1, !dbg !17

!210 = distinct !DIGlobalVariable(scope: null, file: !59, line: 636, type: !178, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !59, line: 636, type: !100, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !59, line: 637, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 22)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !59, line: 638, type: !120, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !59, line: 638, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 15)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !59, line: 639, type: !120, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !59, line: 640, type: !120, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !59, line: 641, type: !120, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !59, line: 654, type: !195, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !59, line: 654, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 40)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !59, line: 666, type: !44, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !59, line: 672, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 71)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !59, line: 678, type: !132, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !59, line: 679, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 27)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !59, line: 681, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 51)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !59, line: 682, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 12)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !215, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "newlines2", scope: !55, file: !2, line: 78, type: !52, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "line_num_end", scope: !55, file: !2, line: 75, type: !54, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "line_num_start", scope: !55, file: !2, line: 72, type: !54, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "line_buf", scope: !55, file: !2, line: 60, type: !171, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "line_num_print", scope: !55, file: !2, line: 69, type: !54, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "pending_cr", scope: !55, file: !2, line: 81, type: !93, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !59, line: 756, type: !259, isLocal: true, isDefinition: true)
!278 = !{}
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 2560, elements: !121)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !282, line: 50, size: 256, elements: !283)
!282 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!283 = !{!284, !285, !286, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !282, line: 52, baseType: !200, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !281, file: !282, line: 55, baseType: !52, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !282, line: 56, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !281, file: !282, line: 57, baseType: !52, size: 32, offset: 192)
!289 = !{i32 7, !"Dwarf Version", i32 5}
!290 = !{i32 2, !"Debug Info Version", i32 3}
!291 = !{i32 1, !"wchar_size", i32 4}
!292 = !{i32 8, !"PIC Level", i32 2}
!293 = !{i32 7, !"PIE Level", i32 2}
!294 = !{i32 7, !"uwtable", i32 2}
!295 = !{i32 7, !"frame-pointer", i32 2}
!296 = !{!"clang version 16.0.4 (https://github.com/llvm/llvm-project ae42196bc493ffe877a7e3dff8be32035dea4d07)"}
!297 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 84, type: !298, scopeLine: 85, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !278)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !52}
!300 = !DILocalVariable(name: "status", arg: 1, scope: !297, file: !2, line: 84, type: !52)
!301 = !DILocation(line: 84, column: 12, scope: !297)
!302 = !DILocation(line: 86, column: 7, scope: !303)
!303 = distinct !DILexicalBlock(scope: !297, file: !2, line: 86, column: 7)
!304 = !DILocation(line: 86, column: 14, scope: !303)
!305 = !DILocation(line: 86, column: 7, scope: !297)
!306 = !DILocation(line: 87, column: 5, scope: !303)
!307 = !DILocation(line: 87, column: 5, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !2, line: 87, column: 5)
!309 = !DILocation(line: 90, column: 15, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !2, line: 89, column: 5)
!311 = !DILocation(line: 93, column: 15, scope: !310)
!312 = !DILocation(line: 90, column: 7, scope: !310)
!313 = !DILocation(line: 94, column: 7, scope: !310)
!314 = !DILocation(line: 98, column: 7, scope: !310)
!315 = !DILocation(line: 100, column: 7, scope: !310)
!316 = !DILocation(line: 109, column: 7, scope: !310)
!317 = !DILocation(line: 115, column: 7, scope: !310)
!318 = !DILocation(line: 116, column: 7, scope: !310)
!319 = !DILocation(line: 117, column: 15, scope: !310)
!320 = !DILocation(line: 123, column: 15, scope: !310)
!321 = !DILocation(line: 123, column: 29, scope: !310)
!322 = !DILocation(line: 117, column: 7, scope: !310)
!323 = !DILocation(line: 124, column: 7, scope: !310)
!324 = !DILocation(line: 126, column: 9, scope: !297)
!325 = !DILocation(line: 126, column: 3, scope: !297)
!326 = distinct !DISubprogram(name: "emit_stdin_note", scope: !59, file: !59, line: 533, type: !327, scopeLine: 534, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !278)
!327 = !DISubroutineType(types: !328)
!328 = !{null}
!329 = !DILocation(line: 535, column: 3, scope: !326)
!330 = !DILocation(line: 538, column: 1, scope: !326)
!331 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !59, file: !59, line: 633, type: !332, scopeLine: 634, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !278)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !200}
!334 = !DILocalVariable(name: "program", arg: 1, scope: !331, file: !59, line: 633, type: !200)
!335 = !DILocation(line: 633, column: 34, scope: !331)
!336 = !DILocalVariable(name: "infomap", scope: !331, file: !59, line: 635, type: !337)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 896, elements: !106)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !331, file: !59, line: 635, size: 128, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !339, file: !59, line: 635, baseType: !200, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !339, file: !59, line: 635, baseType: !200, size: 64, offset: 64)
!343 = !DILocation(line: 635, column: 67, scope: !331)
!344 = !DILocalVariable(name: "node", scope: !331, file: !59, line: 645, type: !200)
!345 = !DILocation(line: 645, column: 15, scope: !331)
!346 = !DILocation(line: 645, column: 22, scope: !331)
!347 = !DILocalVariable(name: "map_prog", scope: !331, file: !59, line: 646, type: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!349 = !DILocation(line: 646, column: 25, scope: !331)
!350 = !DILocation(line: 646, column: 36, scope: !331)
!351 = !DILocation(line: 648, column: 3, scope: !331)
!352 = !DILocation(line: 648, column: 10, scope: !331)
!353 = !DILocation(line: 648, column: 20, scope: !331)
!354 = !DILocation(line: 648, column: 28, scope: !331)
!355 = !DILocation(line: 648, column: 33, scope: !331)
!356 = !DILocation(line: 648, column: 31, scope: !331)
!357 = !DILocation(line: 0, scope: !331)
!358 = !DILocation(line: 649, column: 13, scope: !331)
!359 = distinct !{!359, !351, !358, !360}
!360 = !{!"llvm.loop.mustprogress"}
!361 = !DILocation(line: 651, column: 7, scope: !362)
!362 = distinct !DILexicalBlock(scope: !331, file: !59, line: 651, column: 7)
!363 = !DILocation(line: 651, column: 17, scope: !362)
!364 = !DILocation(line: 651, column: 7, scope: !331)
!365 = !DILocation(line: 652, column: 12, scope: !362)
!366 = !DILocation(line: 652, column: 22, scope: !362)
!367 = !DILocation(line: 652, column: 10, scope: !362)
!368 = !DILocation(line: 652, column: 5, scope: !362)
!369 = !DILocation(line: 654, column: 11, scope: !331)
!370 = !DILocation(line: 654, column: 3, scope: !331)
!371 = !DILocalVariable(name: "lc_messages", scope: !331, file: !59, line: 665, type: !200)
!372 = !DILocation(line: 665, column: 15, scope: !331)
!373 = !DILocation(line: 665, column: 29, scope: !331)
!374 = !DILocation(line: 666, column: 7, scope: !375)
!375 = distinct !DILexicalBlock(scope: !331, file: !59, line: 666, column: 7)
!376 = !DILocation(line: 666, column: 19, scope: !375)
!377 = !DILocation(line: 666, column: 22, scope: !375)
!378 = !DILocation(line: 666, column: 7, scope: !331)
!379 = !DILocation(line: 672, column: 7, scope: !380)
!380 = distinct !DILexicalBlock(scope: !375, file: !59, line: 667, column: 5)
!381 = !DILocation(line: 674, column: 5, scope: !380)
!382 = !DILocalVariable(name: "url_program", scope: !331, file: !59, line: 678, type: !200)
!383 = !DILocation(line: 678, column: 15, scope: !331)
!384 = !DILocation(line: 678, column: 29, scope: !331)
!385 = !DILocation(line: 678, column: 61, scope: !331)
!386 = !DILocation(line: 679, column: 11, scope: !331)
!387 = !DILocation(line: 680, column: 24, scope: !331)
!388 = !DILocation(line: 679, column: 3, scope: !331)
!389 = !DILocation(line: 681, column: 11, scope: !331)
!390 = !DILocation(line: 682, column: 11, scope: !331)
!391 = !DILocation(line: 682, column: 17, scope: !331)
!392 = !DILocation(line: 682, column: 25, scope: !331)
!393 = !DILocation(line: 682, column: 22, scope: !331)
!394 = !DILocation(line: 681, column: 3, scope: !331)
!395 = !DILocation(line: 683, column: 1, scope: !331)
!396 = !DILocalVariable(name: "argc", arg: 1, scope: !49, file: !2, line: 536, type: !52)
!397 = !DILocation(line: 536, column: 11, scope: !49)
!398 = !DILocalVariable(name: "argv", arg: 2, scope: !49, file: !2, line: 536, type: !53)
!399 = !DILocation(line: 536, column: 24, scope: !49)
!400 = !DILocalVariable(name: "have_read_stdin", scope: !49, file: !2, line: 539, type: !93)
!401 = !DILocation(line: 539, column: 8, scope: !49)
!402 = !DILocalVariable(name: "stat_buf", scope: !49, file: !2, line: 541, type: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !404, line: 26, size: 1152, elements: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!405 = !{!406, !409, !411, !413, !415, !417, !419, !420, !421, !424, !426, !428, !436, !437, !438}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !403, file: !404, line: 31, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !408, line: 145, baseType: !96)
!408 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !403, file: !404, line: 36, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !408, line: 148, baseType: !96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !403, file: !404, line: 44, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !408, line: 151, baseType: !96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !403, file: !404, line: 45, baseType: !414, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !408, line: 150, baseType: !65)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !403, file: !404, line: 47, baseType: !416, size: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !408, line: 146, baseType: !65)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !403, file: !404, line: 48, baseType: !418, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !408, line: 147, baseType: !65)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !403, file: !404, line: 50, baseType: !52, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !403, file: !404, line: 52, baseType: !407, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !403, file: !404, line: 57, baseType: !422, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !408, line: 152, baseType: !423)
!423 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !403, file: !404, line: 61, baseType: !425, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !408, line: 175, baseType: !423)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !403, file: !404, line: 63, baseType: !427, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !408, line: 180, baseType: !423)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !403, file: !404, line: 74, baseType: !429, size: 128, offset: 576)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !430, line: 11, size: 128, elements: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!431 = !{!432, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !429, file: !430, line: 16, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !408, line: 160, baseType: !423)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !429, file: !430, line: 21, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !408, line: 197, baseType: !423)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !403, file: !404, line: 75, baseType: !429, size: 128, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !403, file: !404, line: 76, baseType: !429, size: 128, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !403, file: !404, line: 89, baseType: !439, size: 192, offset: 960)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 192, elements: !184)
!440 = !DILocation(line: 541, column: 15, scope: !49)
!441 = !DILocalVariable(name: "number", scope: !49, file: !2, line: 544, type: !93)
!442 = !DILocation(line: 544, column: 8, scope: !49)
!443 = !DILocalVariable(name: "number_nonblank", scope: !49, file: !2, line: 545, type: !93)
!444 = !DILocation(line: 545, column: 8, scope: !49)
!445 = !DILocalVariable(name: "squeeze_blank", scope: !49, file: !2, line: 546, type: !93)
!446 = !DILocation(line: 546, column: 8, scope: !49)
!447 = !DILocalVariable(name: "show_ends", scope: !49, file: !2, line: 547, type: !93)
!448 = !DILocation(line: 547, column: 8, scope: !49)
!449 = !DILocalVariable(name: "show_nonprinting", scope: !49, file: !2, line: 548, type: !93)
!450 = !DILocation(line: 548, column: 8, scope: !49)
!451 = !DILocalVariable(name: "show_tabs", scope: !49, file: !2, line: 549, type: !93)
!452 = !DILocation(line: 549, column: 8, scope: !49)
!453 = !DILocalVariable(name: "file_open_mode", scope: !49, file: !2, line: 550, type: !52)
!454 = !DILocation(line: 550, column: 7, scope: !49)
!455 = !DILocation(line: 567, column: 21, scope: !49)
!456 = !DILocation(line: 567, column: 3, scope: !49)
!457 = !DILocation(line: 568, column: 3, scope: !49)
!458 = !DILocation(line: 569, column: 3, scope: !49)
!459 = !DILocation(line: 570, column: 3, scope: !49)
!460 = !DILocation(line: 576, column: 3, scope: !49)
!461 = !DILocalVariable(name: "c", scope: !49, file: !2, line: 580, type: !52)
!462 = !DILocation(line: 580, column: 7, scope: !49)
!463 = !DILocation(line: 581, column: 3, scope: !49)
!464 = !DILocation(line: 581, column: 28, scope: !49)
!465 = !DILocation(line: 581, column: 34, scope: !49)
!466 = !DILocation(line: 581, column: 15, scope: !49)
!467 = !DILocation(line: 581, column: 13, scope: !49)
!468 = !DILocation(line: 582, column: 10, scope: !49)
!469 = !DILocation(line: 584, column: 15, scope: !470)
!470 = distinct !DILexicalBlock(scope: !49, file: !2, line: 583, column: 5)
!471 = !DILocation(line: 584, column: 7, scope: !470)
!472 = !DILocation(line: 587, column: 18, scope: !473)
!473 = distinct !DILexicalBlock(scope: !470, file: !2, line: 585, column: 9)
!474 = !DILocation(line: 588, column: 27, scope: !473)
!475 = !DILocation(line: 589, column: 11, scope: !473)
!476 = !DILocation(line: 592, column: 21, scope: !473)
!477 = !DILocation(line: 593, column: 28, scope: !473)
!478 = !DILocation(line: 594, column: 11, scope: !473)
!479 = !DILocation(line: 597, column: 18, scope: !473)
!480 = !DILocation(line: 598, column: 11, scope: !473)
!481 = !DILocation(line: 601, column: 25, scope: !473)
!482 = !DILocation(line: 602, column: 11, scope: !473)
!483 = !DILocation(line: 605, column: 21, scope: !473)
!484 = !DILocation(line: 606, column: 28, scope: !473)
!485 = !DILocation(line: 607, column: 11, scope: !473)
!486 = !DILocation(line: 611, column: 11, scope: !473)
!487 = !DILocation(line: 614, column: 28, scope: !473)
!488 = !DILocation(line: 615, column: 11, scope: !473)
!489 = !DILocation(line: 618, column: 28, scope: !473)
!490 = !DILocation(line: 619, column: 21, scope: !473)
!491 = !DILocation(line: 620, column: 21, scope: !473)
!492 = !DILocation(line: 621, column: 11, scope: !473)
!493 = !DILocation(line: 624, column: 21, scope: !473)
!494 = !DILocation(line: 625, column: 11, scope: !473)
!495 = !DILocation(line: 628, column: 21, scope: !473)
!496 = !DILocation(line: 629, column: 11, scope: !473)
!497 = !DILocation(line: 631, column: 9, scope: !473)
!498 = !DILocation(line: 633, column: 9, scope: !473)
!499 = !DILocation(line: 636, column: 11, scope: !473)
!500 = distinct !{!500, !463, !501, !360}
!501 = !DILocation(line: 638, column: 5, scope: !49)
!502 = !DILocation(line: 642, column: 7, scope: !503)
